; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v12 ?v6)
             (pred_7 ?v3 ?v1)
             (pred_3 ?v12 ?v1)
             (pred_2 ?v4 ?v12 )
	     (pred_11 ?v12)
             (pred_1 ?v11)
             (pred_5 ?v3)
             (pred_10 ?v1)
             (pred_6 ?v12)
             (pred_8 ?v3)
             (pred_9 ?v12)
             (pred_4 ))



(:action op_2
:parameters (?v2 ?v9 ?v5 ?v7)
:precondition (and (pred_1 ?v2) (pred_1 ?v9) (pred_5 ?v5) (pred_10 ?v7)
          (pred_12 ?v2 ?v9) (pred_7 ?v5 ?v7)
                   (pred_3 ?v9 ?v7) (pred_11 ?v2) 
                   (pred_6 ?v9) (pred_8 ?v5))
:effect (and  (pred_9 ?v9) (not (pred_6 ?v9))))


(:action op_5
:parameters (?v2 ?v13)
:precondition (and (pred_1 ?v2) (pred_1 ?v13)
               (pred_11 ?v2) (pred_12 ?v2 ?v13) (pred_9 ?v13))
:effect (and (pred_11 ?v13) (not (pred_11 ?v2))))

(:action op_3
:parameters (?v2 ?v5)
:precondition (and (pred_1 ?v2) (pred_5 ?v5) 
                  (pred_11 ?v2) (pred_2 ?v5 ?v2) (pred_4 ))
:effect (and (pred_8 ?v5)
   (not (pred_2 ?v5 ?v2)) (not (pred_4 ))))


(:action op_1
:parameters (?v2 ?v8 ?v10)
:precondition (and (pred_1 ?v2) (pred_5 ?v8) (pred_5 ?v10)
                  (pred_11 ?v2) (pred_8 ?v10) (pred_2 ?v8 ?v2))
:effect (and (pred_8 ?v8) (pred_2 ?v10 ?v2)
        (not (pred_8 ?v10)) (not (pred_2 ?v8 ?v2))))

(:action op_4
:parameters (?v2 ?v5)
:precondition (and (pred_1 ?v2) (pred_5 ?v5) 
                  (pred_11 ?v2) (pred_8 ?v5))
:effect (and (pred_4 ) (pred_2 ?v5 ?v2) (not (pred_8 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_02 obj_10 obj_15 obj_13 obj_30 obj_18 obj_08 obj_19 obj_23 obj_07 obj_12 obj_29 obj_28 obj_27 obj_09 obj_17 obj_21 obj_01 obj_05 obj_20 obj_22 obj_14 obj_03 obj_25
    obj_06 obj_11
    obj_16 obj_04 obj_24
    )

    (:init
       (pred_4)

       (pred_1 obj_26)
       (pred_1 obj_02)
       (pred_1 obj_10)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_1 obj_30)
       (pred_1 obj_18)
       (pred_1 obj_08)
       (pred_1 obj_19)
       (pred_1 obj_23)
       (pred_1 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_29)
       (pred_1 obj_28)
       (pred_1 obj_27)
       (pred_1 obj_09)
       (pred_1 obj_17)
       (pred_1 obj_21)
       (pred_1 obj_01)
       (pred_1 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_22)
       (pred_1 obj_14)
       (pred_1 obj_03)
       (pred_1 obj_25)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_5 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_24)

       (pred_12 obj_26 obj_30)
       (pred_12 obj_26 obj_02)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_02 obj_26)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_15 obj_19)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_13 obj_23)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_30 obj_07)
       (pred_12 obj_30 obj_18)
       (pred_12 obj_30 obj_26)
       (pred_12 obj_18 obj_12)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_18 obj_30)
       (pred_12 obj_08 obj_29)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_19 obj_28)
       (pred_12 obj_19 obj_23)
       (pred_12 obj_19 obj_15)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_23 obj_27)
       (pred_12 obj_23 obj_13)
       (pred_12 obj_23 obj_19)
       (pred_12 obj_07 obj_09)
       (pred_12 obj_07 obj_12)
       (pred_12 obj_07 obj_30)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_29)
       (pred_12 obj_12 obj_18)
       (pred_12 obj_12 obj_07)
       (pred_12 obj_29 obj_21)
       (pred_12 obj_29 obj_28)
       (pred_12 obj_29 obj_08)
       (pred_12 obj_29 obj_12)
       (pred_12 obj_28 obj_01)
       (pred_12 obj_28 obj_27)
       (pred_12 obj_28 obj_19)
       (pred_12 obj_28 obj_29)
       (pred_12 obj_27 obj_05)
       (pred_12 obj_27 obj_23)
       (pred_12 obj_27 obj_28)
       (pred_12 obj_09 obj_20)
       (pred_12 obj_09 obj_17)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_17 obj_22)
       (pred_12 obj_17 obj_21)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_09)
       (pred_12 obj_21 obj_14)
       (pred_12 obj_21 obj_01)
       (pred_12 obj_21 obj_29)
       (pred_12 obj_21 obj_17)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_01 obj_28)
       (pred_12 obj_01 obj_21)
       (pred_12 obj_05 obj_25)
       (pred_12 obj_05 obj_27)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_20 obj_22)
       (pred_12 obj_20 obj_09)
       (pred_12 obj_22 obj_14)
       (pred_12 obj_22 obj_17)
       (pred_12 obj_22 obj_20)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_21)
       (pred_12 obj_14 obj_22)
       (pred_12 obj_03 obj_25)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_25 obj_05)
       (pred_12 obj_25 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_05)
       (pred_6 obj_14)
       (pred_3  obj_20 obj_06)
       (pred_3  obj_05 obj_11)
       (pred_3  obj_14 obj_11)
       (pred_9 obj_26)
       (pred_9 obj_02)
       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_13)
       (pred_9 obj_30)
       (pred_9 obj_18)
       (pred_9 obj_08)
       (pred_9 obj_19)
       (pred_9 obj_23)
       (pred_9 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_29)
       (pred_9 obj_28)
       (pred_9 obj_27)
       (pred_9 obj_09)
       (pred_9 obj_17)
       (pred_9 obj_21)
       (pred_9 obj_01)
       (pred_9 obj_22)
       (pred_9 obj_03)
       (pred_9 obj_25)

       (pred_7  obj_16 obj_06)
       (pred_7  obj_04 obj_11)
       (pred_7  obj_24 obj_11)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_24 obj_10)
       (pred_11 obj_23)
    )

    (:goal (and
       (pred_2 obj_16 obj_29)
       (pred_2 obj_04 obj_23)
    ))
(:constraints
  (always (not (pred_11 obj_08)))
)
)

; plan
1. (op_5 obj_23 obj_19)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_19)
   goals met: 0 of 2
2. (op_5 obj_19 obj_28)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_28)
   goals met: 0 of 2
3. (op_5 obj_28 obj_29)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_29)
   goals met: 0 of 2
4. (op_5 obj_29 obj_12)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_12)
   goals met: 0 of 2
5. (op_5 obj_12 obj_18)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_18)
   goals met: 0 of 2
6. (op_3 obj_18 obj_16)
   deleted: (pred_2 obj_16 obj_18) (pred_4)
   added: (pred_8 obj_16)
   goals met: 0 of 2
7. (op_5 obj_18 obj_12)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_12)
   goals met: 0 of 2
8. (op_5 obj_12 obj_29)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_29)
   goals met: 0 of 2
9. (op_4 obj_29 obj_16)
   deleted: (pred_8 obj_16)
   added: (pred_4) (pred_2 obj_16 obj_29)
   goals met: 1 of 2
10. (op_5 obj_29 obj_12)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_12)
   goals met: 1 of 2
11. (op_5 obj_12 obj_07)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_07)
   goals met: 1 of 2
12. (op_3 obj_07 obj_04)
   deleted: (pred_2 obj_04 obj_07) (pred_4)
   added: (pred_8 obj_04)
   goals met: 1 of 2
13. (op_5 obj_07 obj_12)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_12)
   goals met: 1 of 2
14. (op_5 obj_12 obj_29)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_29)
   goals met: 1 of 2
15. (op_5 obj_29 obj_28)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_28)
   goals met: 1 of 2
16. (op_5 obj_28 obj_19)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_19)
   goals met: 1 of 2
17. (op_5 obj_19 obj_23)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_23)
   goals met: 1 of 2
18. (op_4 obj_23 obj_04)
   deleted: (pred_8 obj_04)
   added: (pred_4) (pred_2 obj_04 obj_23)
   goals met: 2 of 2
